In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np

In [9]:
df_2018 = pd.read_csv('2018.csv', index_col=0)

In [10]:
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.50,8.25,NaN,NaN,5.92,3.0,3.0,3.75,NaN,3.0,NaN,18
NaN,18010229,9.00,8.25,NaN,NaN,7.75,6.0,9.0,7.50,NaN,8.8,NaN,18
NaN,18010232,NaN,NaN,5.5,5.42,NaN,NaN,4.0,5.50,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,NaN,NaN,5.17,3.5,2.6,5.75,NaN,3.4,NaN,18
NaN,18010247,6.25,8.00,NaN,NaN,5.92,3.5,3.0,6.75,NaN,3.8,NaN,18

In [11]:
df_2018 = df_2018.fillna('-1')
df_2018.head()

,code,dia,cd,hoa,khtn,khxh,su,anh,van,sinh,toan,li,city
NaN,18010226,6.5,8.25,-1,-1,5.92,3.0,3.0,3.75,-1,3.0,-1,18
NaN,18010229,9.0,8.25,-1,-1,7.75,6.0,9.0,7.5,-1,8.8,-1,18
NaN,18010232,-1,-1,5.5,5.42,-1,-1,4.0,5.5,5.0,6.0,5.75,18
NaN,18010242,4.75,7.25,-1,-1,5.17,3.5,2.6,5.75,-1,3.4,-1,18
NaN,18010247,6.25,8.0,-1,-1,5.92,3.5,3.0,6.75,-1,3.8,-1,18

### Fill missing value by -1

In [12]:
df_2018.isnull().sum()

code    0
dia     0
cd      0
hoa     0
khtn    0
khxh    0
su      0
anh     0
van     0
sinh    0
toan    0
li      0
city    0
dtype: int64

In [14]:
df_2018.index

Float64Index([nan, nan, nan, nan, nan, nan, nan, nan, nan, nan,
              ...
              nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
             dtype='float64', length=744396)

In [19]:
df_2018.reset_index(drop=True, inplace=True)

In [20]:
df_2018.index

RangeIndex(start=0, stop=744396, step=1)

In [21]:
df_2018.head()

       code   dia    cd  hoa  khtn  khxh   su  anh   van sinh toan    li  city
0  18010226   6.5  8.25   -1    -1  5.92  3.0  3.0  3.75   -1  3.0    -1    18
1  18010229   9.0  8.25   -1    -1  7.75  6.0  9.0   7.5   -1  8.8    -1    18
2  18010232    -1    -1  5.5  5.42    -1   -1  4.0   5.5  5.0  6.0  5.75    18
3  18010242  4.75  7.25   -1    -1  5.17  3.5  2.6  5.75   -1  3.4    -1    18
4  18010247  6.25   8.0   -1    -1  5.92  3.5  3.0  6.75   -1  3.8    -1    18